0xsmirk/mcu_cmsis_svd/Spansion/MB9AF15xN.svd
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description>Extended pin function setting register 11</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UERLC" -->
            <field>
              <name>UERLC</name>
              <description>UERLC relocation select bit</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED15B" -->
            <field>
              <name>UED15B</name>
              <description>UED15B input/output select bit</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED14B" -->
            <field>
              <name>UED14B</name>
              <description>UED14B output select bit</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED13B" -->
            <field>
              <name>UED13B</name>
              <description>UED13B output select bit</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED12B" -->
            <field>
              <name>UED12B</name>
              <description>UED12B output select bit</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED11B" -->
            <field>
              <name>UED11B</name>
              <description>UED11B output select bit</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED10B" -->
            <field>
              <name>UED10B</name>
              <description>UED10B output select bit</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED09B" -->
            <field>
              <name>UED09B</name>
              <description>UED09B output select bit</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED08B" -->
            <field>
              <name>UED08B</name>
              <description>UED08B output select bit</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED07B" -->
            <field>
              <name>UED07B</name>
              <description>UED07B output select bit</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED06B" -->
            <field>
              <name>UED06B</name>
              <description>UED06B output select bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED05B" -->
            <field>
              <name>UED05B</name>
              <description>UED05B output select bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED04B" -->
            <field>
              <name>UED04B</name>
              <description>UED04B output select bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED03B" -->
            <field>
              <name>UED03B</name>
              <description>UED03B output select bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED02B" -->
            <field>
              <name>UED02B</name>
              <description>UED02B output select bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED01B" -->
            <field>
              <name>UED01B</name>
              <description>UED01B output select bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED00B" -->
            <field>
              <name>UED00B</name>
              <description>UED00B output select bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA07E" -->
            <field>
              <name>UEA07E</name>
              <description>UEA07E output select bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA06E" -->
            <field>
              <name>UEA06E</name>
              <description>UEA06E output select bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA05E" -->
            <field>
              <name>UEA05E</name>
              <description>UEA05E output select bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA04E" -->
            <field>
              <name>UEA04E</name>
              <description>UEA04E output select bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA03E" -->
            <field>
              <name>UEA03E</name>
              <description>UEA03E output select bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA02E" -->
            <field>
              <name>UEA02E</name>
              <description>UEA02E output select bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA01E" -->
            <field>
              <name>UEA01E</name>
              <description>UEA01E output select bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS0E" -->
            <field>
              <name>UECS0E</name>
              <description>UECS0E output select bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEALEE" -->
            <field>
              <name>UEALEE</name>
              <description>UEALEE output select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description>Extended pin function setting register 12</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB11S" -->
            <field>
              <name>TIOB11S</name>
              <description>TIOB11 Input Select bits</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11E" -->
            <field>
              <name>TIOA11E</name>
              <description>TIOA11 Output Select bits</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11S" -->
            <field>
              <name>TIOA11S</name>
              <description>TIOA11 Input Select bits</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB10S" -->
            <field>
              <name>TIOB10S</name>
              <description>TIOB10 Input Select bits</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA10E" -->
            <field>
              <name>TIOA10E</name>
              <description>TIOA10 Output Select bits</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB9S" -->
            <field>
              <name>TIOB9S</name>
              <description>TIOB9 Input Select bits</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9E" -->
            <field>
              <name>TIOA9E</name>
              <description>TIOA9 Output Select bits</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9S" -->
            <field>
              <name>TIOA9S</name>
              <description>TIOA9 Input Select bits</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB8S" -->
            <field>
              <name>TIOB8S</name>
              <description>TIOB8 Input Select bits</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA8E" -->
            <field>
              <name>TIOA8E</name>
              <description>TIOA8 Output Select bits</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description>Extended pin function setting register 13</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB15S" -->
            <field>
              <name>TIOB15S</name>
              <description>TIOB15 Input Select bits</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15E" -->
            <field>
              <name>TIOA15E</name>
              <description>TIOA15 Output Select bits</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15S" -->
            <field>
              <name>TIOA15S</name>
              <description>TIOA15 Input Select bits</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB14S" -->
            <field>
              <name>TIOB14S</name>
              <description>TIOB14 Input Select bits</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA14E" -->
            <field>
              <name>TIOA14E</name>
              <description>TIOA14 Output Select bits</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB13S" -->
            <field>
              <name>TIOB13S</name>
              <description>TIOB13 Input Select bits</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13E" -->
            <field>
              <name>TIOA13E</name>
              <description>TIOA13 Output Select bits</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13S" -->
            <field>
              <name>TIOA13S</name>
              <description>TIOA13 Input Select bits</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB12S" -->
            <field>
              <name>TIOB12S</name>
              <description>TIOB12 Input Select bits</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA12E" -->
            <field>
              <name>TIOA12E</name>
              <description>TIOA12 Output Select bits</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended pin function setting register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT23S" -->
            <field>
              <name>EINT23S</name>
              <description>External interrupt 23 input select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT22S" -->
            <field>
              <name>EINT22S</name>
              <description>External interrupt 22 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description>External interrupt 21 input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description>External interrupt 20 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description>External interrupt 19 input select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description>External interrupt 18 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description>External interrupt 17 input select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description>External interrupt 16 input select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
